[command]/home/runner/work/_temp/c3acc44f-1d93-437c-8862-84842cb7cb91/terraform-bin plan -input=false
[0m[1mcloudflare_record.mx: Refreshing state... [id=a0623c1be176d67b9218d645038f91f9][0m
[0m[1mcloudflare_record.dkim2: Refreshing state... [id=3d00aa0fa0a883a5f22b37cd3bf3fd41][0m
[0m[1mcloudflare_record.spf: Refreshing state... [id=d2249153382fcce1f83414979a162412][0m
[0m[1mcloudflare_record.www: Refreshing state... [id=67f392eb43d02d76583f371cc4edbd75][0m
[0m[1mcloudflare_record.google-site-verification: Refreshing state... [id=81c85bcd96fbceb2046ba072ebbceee9][0m
[0m[1mcloudflare_record.dkim1: Refreshing state... [id=23688cb6867edfd29c1cb93c4628f745][0m
[0m[1mcloudflare_record.caa: Refreshing state... [id=f0ff1c2a96b7c0ec2b0f8773d10e19e9][0m
[0m[1mcloudflare_record.outlook-autodiscover: Refreshing state... [id=975a5b204834c22ad7173255b0c4cb34][0m
[0m[1mhcloud_ssh_key.kubenode: Refreshing state... [id=11424521][0m
[0m[1mhcloud_volume.kubenode_storage: Refreshing state... [id=32847947][0m
[0m[1mhcloud_server.kubenode: Refreshing state... [id=33332537][0m
[0m[1mcloudflare_record.umami: Refreshing state... [id=31424bb7dda31c8e8263d7f82484c818][0m
[0m[1mhcloud_volume_attachment.kubenode_storagemount: Refreshing state... [id=32847947][0m
[0m[1mlocal_file.ansible_inventory: Refreshing state... [id=7ebef418a93ac27e6298647223b894cc07523b35][0m
[0m[1mcloudflare_record.vaultwarden: Refreshing state... [id=b3cde3c106736e12636512fb90277222][0m
[0m[1mcloudflare_record.link: Refreshing state... [id=0d6fd87c7879b54263fc3697b8dcf9c6][0m
[0m[1mcloudflare_record.k8s: Refreshing state... [id=5f72f654346f4358c118432cdf63b1ee][0m
[0m[1mcloudflare_record.root-aaaa: Refreshing state... [id=6a6cb115e75174e7d60271305142cb4c][0m
[0m[1mcloudflare_record.root: Refreshing state... [id=d23c6b5c5f5e80bdb5e3ed8bd361c975][0m
[0m[1mcloudflare_record.grafana: Refreshing state... [id=c9d6af5b55c0dc004d5d067c56610baa][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
  [33m~[0m update in-place[0m

Terraform will perform the following actions:

[1m  # cloudflare_record.caa[0m will be updated in-place
[0m  [33m~[0m[0m resource "cloudflare_record" "caa" {
        id              = "f0ff1c2a96b7c0ec2b0f8773d10e19e9"
        name            = "thetillhoff.de"
        tags            = []
        [90m# (11 unchanged attributes hidden)[0m[0m

      [31m-[0m[0m data {
          [31m-[0m[0m algorithm      = 0 [90m-> null[0m[0m
          [31m-[0m[0m altitude       = 0 [90m-> null[0m[0m
          [31m-[0m[0m digest_type    = 0 [90m-> null[0m[0m
          [31m-[0m[0m flags          = "0" [90m-> null[0m[0m
          [31m-[0m[0m key_tag        = 0 [90m-> null[0m[0m
          [31m-[0m[0m lat_degrees    = 0 [90m-> null[0m[0m
          [31m-[0m[0m lat_minutes    = 0 [90m-> null[0m[0m
          [31m-[0m[0m lat_seconds    = 0 [90m-> null[0m[0m
          [31m-[0m[0m long_degrees   = 0 [90m-> null[0m[0m
          [31m-[0m[0m long_minutes   = 0 [90m-> null[0m[0m
          [31m-[0m[0m long_seconds   = 0 [90m-> null[0m[0m
          [31m-[0m[0m matching_type  = 0 [90m-> null[0m[0m
          [31m-[0m[0m order          = 0 [90m-> null[0m[0m
          [31m-[0m[0m port           = 0 [90m-> null[0m[0m
          [31m-[0m[0m precision_horz = 0 [90m-> null[0m[0m
          [31m-[0m[0m precision_vert = 0 [90m-> null[0m[0m
          [31m-[0m[0m preference     = 0 [90m-> null[0m[0m
          [31m-[0m[0m priority       = 0 [90m-> null[0m[0m
          [31m-[0m[0m protocol       = 0 [90m-> null[0m[0m
          [31m-[0m[0m selector       = 0 [90m-> null[0m[0m
          [31m-[0m[0m size           = 0 [90m-> null[0m[0m
          [31m-[0m[0m tag            = "issue" [90m-> null[0m[0m
          [31m-[0m[0m type           = 0 [90m-> null[0m[0m
          [31m-[0m[0m usage          = 0 [90m-> null[0m[0m
          [31m-[0m[0m value          = "letsencrypt.org" [90m-> null[0m[0m
          [31m-[0m[0m weight         = 0 [90m-> null[0m[0m
        }
    }

[1m  # local_file.ansible_inventory[0m will be created
[0m  [32m+[0m[0m resource "local_file" "ansible_inventory" {
      [32m+[0m[0m content              = <<-EOT
            # This inventory file is managed by Terraform. Do not change manually!
            [kubenodes]
            167.235.25.128
        EOT
      [32m+[0m[0m content_base64sha256 = (known after apply)
      [32m+[0m[0m content_base64sha512 = (known after apply)
      [32m+[0m[0m content_md5          = (known after apply)
      [32m+[0m[0m content_sha1         = (known after apply)
      [32m+[0m[0m content_sha256       = (known after apply)
      [32m+[0m[0m content_sha512       = (known after apply)
      [32m+[0m[0m directory_permission = "0777"
      [32m+[0m[0m file_permission      = "0777"
      [32m+[0m[0m filename             = "../inventory.ini"
      [32m+[0m[0m id                   = (known after apply)
    }

[1mPlan:[0m 1 to add, 1 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
::debug::Terraform exited with code 0.
::debug::stdout: [0m[1mcloudflare_record.mx: Refreshing state... [id=a0623c1be176d67b9218d645038f91f9][0m%0A[0m[1mcloudflare_record.dkim2: Refreshing state... [id=3d00aa0fa0a883a5f22b37cd3bf3fd41][0m%0A[0m[1mcloudflare_record.spf: Refreshing state... [id=d2249153382fcce1f83414979a162412][0m%0A[0m[1mcloudflare_record.www: Refreshing state... [id=67f392eb43d02d76583f371cc4edbd75][0m%0A[0m[1mcloudflare_record.google-site-verification: Refreshing state... [id=81c85bcd96fbceb2046ba072ebbceee9][0m%0A[0m[1mcloudflare_record.dkim1: Refreshing state... [id=23688cb6867edfd29c1cb93c4628f745][0m%0A[0m[1mcloudflare_record.caa: Refreshing state... [id=f0ff1c2a96b7c0ec2b0f8773d10e19e9][0m%0A[0m[1mcloudflare_record.outlook-autodiscover: Refreshing state... [id=975a5b204834c22ad7173255b0c4cb34][0m%0A[0m[1mhcloud_ssh_key.kubenode: Refreshing state... [id=11424521][0m%0A[0m[1mhcloud_volume.kubenode_storage: Refreshing state... [id=32847947][0m%0A[0m[1mhcloud_server.kubenode: Refreshing state... [id=33332537][0m%0A[0m[1mcloudflare_record.umami: Refreshing state... [id=31424bb7dda31c8e8263d7f82484c818][0m%0A[0m[1mhcloud_volume_attachment.kubenode_storagemount: Refreshing state... [id=32847947][0m%0A[0m[1mlocal_file.ansible_inventory: Refreshing state... [id=7ebef418a93ac27e6298647223b894cc07523b35][0m%0A[0m[1mcloudflare_record.vaultwarden: Refreshing state... [id=b3cde3c106736e12636512fb90277222][0m%0A[0m[1mcloudflare_record.link: Refreshing state... [id=0d6fd87c7879b54263fc3697b8dcf9c6][0m%0A[0m[1mcloudflare_record.k8s: Refreshing state... [id=5f72f654346f4358c118432cdf63b1ee][0m%0A[0m[1mcloudflare_record.root-aaaa: Refreshing state... [id=6a6cb115e75174e7d60271305142cb4c][0m%0A[0m[1mcloudflare_record.root: Refreshing state... [id=d23c6b5c5f5e80bdb5e3ed8bd361c975][0m%0A[0m[1mcloudflare_record.grafana: Refreshing state... [id=c9d6af5b55c0dc004d5d067c56610baa][0m%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  [32m+[0m create[0m%0A  [33m~[0m update in-place[0m%0A%0ATerraform will perform the following actions:%0A%0A[1m  # cloudflare_record.caa[0m will be updated in-place%0A[0m  [33m~[0m[0m resource "cloudflare_record" "caa" {%0A        id              = "f0ff1c2a96b7c0ec2b0f8773d10e19e9"%0A        name            = "thetillhoff.de"%0A        tags            = []%0A        [90m# (11 unchanged attributes hidden)[0m[0m%0A%0A      [31m-[0m[0m data {%0A          [31m-[0m[0m algorithm      = 0 [90m-> null[0m[0m%0A          [31m-[0m[0m altitude       = 0 [90m-> null[0m[0m%0A          [31m-[0m[0m digest_type    = 0 [90m-> null[0m[0m%0A          [31m-[0m[0m flags          = "0" [90m-> null[0m[0m%0A          [31m-[0m[0m key_tag        = 0 [90m-> null[0m[0m%0A          [31m-[0m[0m lat_degrees    = 0 [90m-> null[0m[0m%0A          [31m-[0m[0m lat_minutes    = 0 [90m-> null[0m[0m%0A          [31m-[0m[0m lat_seconds    = 0 [90m-> null[0m[0m%0A          [31m-[0m[0m long_degrees   = 0 [90m-> null[0m[0m%0A          [31m-[0m[0m long_minutes   = 0 [90m-> null[0m[0m%0A          [31m-[0m[0m long_seconds   = 0 [90m-> null[0m[0m%0A          [31m-[0m[0m matching_type  = 0 [90m-> null[0m[0m%0A          [31m-[0m[0m order          = 0 [90m-> null[0m[0m%0A          [31m-[0m[0m port           = 0 [90m-> null[0m[0m%0A          [31m-[0m[0m precision_horz = 0 [90m-> null[0m[0m%0A          [31m-[0m[0m precision_vert = 0 [90m-> null[0m[0m%0A          [31m-[0m[0m preference     = 0 [90m-> null[0m[0m%0A          [31m-[0m[0m priority       = 0 [90m-> null[0m[0m%0A          [31m-[0m[0m protocol       = 0 [90m-> null[0m[0m%0A          [31m-[0m[0m selector       = 0 [90m-> null[0m[0m%0A          [31m-[0m[0m size           = 0 [90m-> null[0m[0m%0A          [31m-[0m[0m tag            = "issue" [90m-> null[0m[0m%0A          [31m-[0m[0m type           = 0 [90m-> null[0m[0m%0A          [31m-[0m[0m usage          = 0 [90m-> null[0m[0m%0A          [31m-[0m[0m value          = "letsencrypt.org" [90m-> null[0m[0m%0A          [31m-[0m[0m weight         = 0 [90m-> null[0m[0m%0A        }%0A    }%0A%0A[1m  # local_file.ansible_inventory[0m will be created%0A[0m  [32m+[0m[0m resource "local_file" "ansible_inventory" {%0A      [32m+[0m[0m content              = <<-EOT%0A            # This inventory file is managed by Terraform. Do not change manually!%0A            [kubenodes]%0A            167.235.25.128%0A        EOT%0A      [32m+[0m[0m content_base64sha256 = (known after apply)%0A      [32m+[0m[0m content_base64sha512 = (known after apply)%0A      [32m+[0m[0m content_md5          = (known after apply)%0A      [32m+[0m[0m content_sha1         = (known after apply)%0A      [32m+[0m[0m content_sha256       = (known after apply)%0A      [32m+[0m[0m content_sha512       = (known after apply)%0A      [32m+[0m[0m directory_permission = "0777"%0A      [32m+[0m[0m file_permission      = "0777"%0A      [32m+[0m[0m filename             = "../inventory.ini"%0A      [32m+[0m[0m id                   = (known after apply)%0A    }%0A%0A[1mPlan:[0m 1 to add, 1 to change, 0 to destroy.%0A[0m[90m%0A─────────────────────────────────────────────────────────────────────────────[0m%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0A
::debug::stderr: 
::debug::exitcode: 0
